Autodesk.Revit.DB.FormatValueOptions.GetFormatOptions
Gets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
By default, the FormatOptions represents default formatting
(UseDefault is true) and the FormatOptions in the Units class will
be used.
Returns:
A copy of the FormatOptions.
Since:
2014

Autodesk.Revit.DB.FormatValueOptions.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
By default, the FormatOptions represents default formatting
(UseDefault is true) and the FormatOptions in the Units class will
be used.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FormatValueOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormatValueOptions.AppendUnitSymbol
Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions.
True to force a unit symbol to be appended; false to use the settings specified by the FormatOptions.  The default is false.
Since:
2014

Autodesk.Revit.DB.FormatValueOptions.#ctor
Creates a new FormatValueOptions object with default settings.
Since:
2014

Autodesk.Revit.DB.FormatValueOptions
Options for formatting numbers with units into strings.
Since:
2014